In [1]:
# Imports
import sqlalchemy
import pandas as pd
import numpy as np

# 1 - Extract

In [2]:
# Criação da engine do sql alchemy para o banco operacional.
db_connection = sqlalchemy.create_engine(
    'postgresql+pg8000://postgres:123456@localhost:5433/operational_db',
    client_encoding='utf8',
)

In [3]:
# Extração da tabela clientes para dataframe do pandas
clientes_df = pd.read_sql('SELECT * FROM relacional.clientes', db_connection)
clientes_df.head()

   idcliente               cliente estado sexo  status
0          1  Adelina Buenaventura     RJ    M  Silver
1          2          Adelino Gago     RJ    M  Silver
2          3         Adélio Lisboa     SE    M  Silver
3          4         Adérito Bahía     MA    M  Silver
4          5       Adolfo Patrício     PE    M  Silver

In [4]:
# Extração da tabela vendas para dataframe do pandas
vendas_df = pd.read_sql('SELECT * FROM relacional.vendas', db_connection)
vendas_df.head()

   idvenda  idvendedor  idcliente        data     total
0        1           1          1  2021-01-01   8053.60
1        2           6        185  2021-01-01    150.40
2        3           7         31  2021-01-02   6087.00
3        4           5          1  2021-01-02  13828.60
4        5           8        120  2021-01-03  26096.66

In [5]:
# Extração da tabela itensvenda para dataframe do pandas
itensvenda_df = pd.read_sql('SELECT * FROM relacional.itensvenda', db_connection)
itensvenda_df.head()

   idproduto  idvenda  quantidade  valorunitario  valortotal  desconto
0          2        1           1        7820.85     7820.85      0.00
1          9        1           1          97.75       97.75      0.98
2         10        1           1         135.00      135.00      1.35
3          8        2           1         150.40      150.40      1.50
4          5        3           2        2966.00     5932.00      0.00

In [6]:
# Extração da tabela vendedores para dataframe do pandas
vendedores_df = pd.read_sql('SELECT * FROM relacional.vendedores', db_connection)
vendedores_df.head()

   idvendedor              nome
0           1      Armando Lago
1           2  Capitolino Bahía
2           3     Daniel Pirajá
3           4   Godo Capiperibe
4           5    Hélio Liberato

In [7]:
# Extração da tabela produtos para dataframe do pandas
produtos_df = pd.read_sql('SELECT * FROM relacional.produtos', db_connection)
produtos_df.head()

   idproduto                                            produto   preco
0          1  Bicicleta Aro 29 Mountain Bike Endorphine 6.3 ...  8852.0
1          2  Bicicleta Altools Stroll Aro 26 Freio À Disco ...  9201.0
2          3  Bicicleta Gts Advanced 1.0 Aro 29 Freio Disco ...  4255.0
3          4  Bicicleta Trinc Câmbios Shimano Aro 29 Freio A...  7658.0
4          5  Bicicleta Gometws Endorphine 7.3 - Shimano Alu...  2966.0

# 2 - Transform

## dm_cliente

In [8]:
dm_cliente_df = clientes_df.rename(
    columns={
        'idcliente': 'id_cliente',
        'cliente': 'nome_cliente',
        'estado': 'uf_cliente',
        'sexo': 'sexo_cliente',
        'status': 'status_cliente'
    },
    inplace=False,
)
dm_cliente_df.head()

   id_cliente          nome_cliente uf_cliente sexo_cliente status_cliente
0           1  Adelina Buenaventura         RJ            M         Silver
1           2          Adelino Gago         RJ            M         Silver
2           3         Adélio Lisboa         SE            M         Silver
3           4         Adérito Bahía         MA            M         Silver
4           5       Adolfo Patrício         PE            M         Silver

## dm_vendedor

In [9]:
dm_vendedor_df = vendedores_df.rename(
    columns={'idvendedor': 'id_vendedor', 'nome': 'nome_vendedor'},
    inplace=False,
)
dm_vendedor_df.head()

   id_vendedor     nome_vendedor
0            1      Armando Lago
1            2  Capitolino Bahía
2            3     Daniel Pirajá
3            4   Godo Capiperibe
4            5    Hélio Liberato

## dm_nivel_vendedor

In [10]:
dm_nivel_vendedor_df = pd.DataFrame(
    {
        'id_nivel_vendedor': [1, 2, 3],
        'nivel_vendedor': [1, 2, 3],
        'descricao_nivel_vendedor': ['até 199 mil reais', 'entre 200 e 299 mil reais', 'a partir de 300 mil reais'],
    }
)
dm_nivel_vendedor_df.head()

   id_nivel_vendedor  nivel_vendedor   descricao_nivel_vendedor
0                  1               1          até 199 mil reais
1                  2               2  entre 200 e 299 mil reais
2                  3               3  a partir de 300 mil reais

## dm_produto

In [11]:
dm_produto_df = produtos_df.rename(
    columns={'idproduto': 'id_produto', 'produto': 'nome_produto', 'preco': 'valor_unitario'},
    inplace=False,
)
dm_produto_df.head()

,id_produto,nome_produto,valor_unitario
0,1,Bicicleta Aro 29 Mountain Bike Endorphine 6.3 ...,8852.0
1,2,Bicicleta Altools Stroll Aro 26 Freio À Disco ...,9201.0
2,3,Bicicleta Gts Advanced 1.0 Aro 29 Freio Disco ...,4255.0
3,4,Bicicleta Trinc Câmbios Shimano Aro 29 Freio A...,7658.0
4,5,Bicicleta Gometws Endorphine 7.3 - Shimano Alu...,2966.0

## dm_classe_produto

In [12]:
dm_classe_produto_df = pd.DataFrame(
    {
        'id_classe_produto': [1, 2, 3],
        'classe_produto': ['Popular', 'Media', 'Alta'],
        'descricao_classe_produto': ['até R$499,99', 'entre R$500,00 e R$2.999,99', 'a partir de R$3.000,00'],
    }
)
dm_classe_produto_df.head()

   id_classe_produto classe_produto     descricao_classe_produto
0                  1        Popular                 até R$499,99
1                  2          Media  entre R$500,00 e R$2.999,99
2                  3           Alta       a partir de R$3.000,00

## dm_tempo

In [13]:
dm_tempo_df = pd.DataFrame()

dm_tempo_df['id_tempo'] = (
    vendas_df['data'].astype(str).str.replace('-', '')
).astype(int)
dm_tempo_df['data_venda'] = vendas_df['data']

dm_tempo_df['ano_venda'] = pd.DatetimeIndex(dm_tempo_df['data_venda']).year
dm_tempo_df['mes_venda'] = pd.DatetimeIndex(dm_tempo_df['data_venda']).month
dm_tempo_df['dia_venda'] = pd.DatetimeIndex(dm_tempo_df['data_venda']).day

dm_tempo_df['mes_venda_extenso'] = pd.DatetimeIndex(
    dm_tempo_df['data_venda']
).month
dm_tempo_df['mes_venda_extenso'] = dm_tempo_df['mes_venda_extenso'].replace(
    1, 'Janeiro'
)
dm_tempo_df['mes_venda_extenso'] = dm_tempo_df['mes_venda_extenso'].replace(
    2, 'Fevereiro'
)
dm_tempo_df['mes_venda_extenso'] = dm_tempo_df['mes_venda_extenso'].replace(
    3, 'Março'
)
dm_tempo_df['mes_venda_extenso'] = dm_tempo_df['mes_venda_extenso'].replace(
    4, 'Abril'
)
dm_tempo_df['mes_venda_extenso'] = dm_tempo_df['mes_venda_extenso'].replace(
    5, 'Maio'
)
dm_tempo_df['mes_venda_extenso'] = dm_tempo_df['mes_venda_extenso'].replace(
    6, 'Junho'
)
dm_tempo_df['mes_venda_extenso'] = dm_tempo_df['mes_venda_extenso'].replace(
    7, 'Julho'
)
dm_tempo_df['mes_venda_extenso'] = dm_tempo_df['mes_venda_extenso'].replace(
    8, 'Agosto'
)
dm_tempo_df['mes_venda_extenso'] = dm_tempo_df['mes_venda_extenso'].replace(
    9, 'Setembro'
)
dm_tempo_df['mes_venda_extenso'] = dm_tempo_df['mes_venda_extenso'].replace(
    10, 'Outubro'
)
dm_tempo_df['mes_venda_extenso'] = dm_tempo_df['mes_venda_extenso'].replace(
    11, 'Novembro'
)
dm_tempo_df['mes_venda_extenso'] = dm_tempo_df['mes_venda_extenso'].replace(
    12, 'Dezembro'
)

dm_tempo_df['trimestre_venda_aux'] = pd.DatetimeIndex(
    dm_tempo_df['data_venda']
).month
dm_tempo_df['trimestre_venda_aux'] = pd.cut(
    dm_tempo_df['trimestre_venda_aux'],
    bins=[1, 4, 7, 10, float('inf')],
    right=False,
    labels=[1, 2, 3, 4],
)


dm_tempo_df['trimestre_venda'] = dm_tempo_df['ano_venda'].astype(
    str) + '/' + dm_tempo_df['trimestre_venda_aux'].astype(str)
dm_tempo_df.drop(columns=['trimestre_venda_aux'], inplace=True)

dm_tempo_df.drop_duplicates(inplace=True)
dm_tempo_df.head()

,id_tempo,data_venda,ano_venda,mes_venda,dia_venda,mes_venda_extenso,trimestre_venda
0,20210101,2021-01-01,2021,1,1,Janeiro,2021/1
2,20210102,2021-01-02,2021,1,2,Janeiro,2021/1
4,20210103,2021-01-03,2021,1,3,Janeiro,2021/1
5,20210104,2021-01-04,2021,1,4,Janeiro,2021/1
6,20210106,2021-01-06,2021,1,6,Janeiro,2021/1

## ft_vendas

In [14]:
ft_vendas_df = pd.merge(
    left=vendas_df, right=itensvenda_df, how='left', on='idvenda'
)
ft_vendas_df.head()

,idvenda,idvendedor,idcliente,data,total,idproduto,quantidade,valorunitario,valortotal,desconto
0,1,1,1,2021-01-01,8053.6,2,1,7820.85,7820.85,0.00
1,1,1,1,2021-01-01,8053.6,9,1,97.75,97.75,0.98
2,1,1,1,2021-01-01,8053.6,10,1,135.00,135.00,1.35
3,2,6,185,2021-01-01,150.4,8,1,150.40,150.40,1.50
4,3,7,31,2021-01-02,6087.0,5,2,2966.00,5932.00,0.00

In [15]:
ft_vendas_df.rename(
    columns={
        'idcliente': 'id_cliente',
        'idvendedor': 'id_vendedor',
        'idproduto': 'id_produto',
        'idproduto': 'id_produto',
        'desconto': 'desconto_venda',
        'valorunitario': 'valor_unitario',
        'total': 'total_venda',
    },
    inplace=True,
)

ft_vendas_df['id_tempo'] = (
    ft_vendas_df['data'].astype(str).str.replace('-', '')
).astype(int)

ft_vendas_df.head()

,idvenda,id_vendedor,id_cliente,data,total_venda,id_produto,quantidade,valor_unitario,valortotal,desconto_venda,id_tempo
0,1,1,1,2021-01-01,8053.6,2,1,7820.85,7820.85,0.00,20210101
1,1,1,1,2021-01-01,8053.6,9,1,97.75,97.75,0.98,20210101
2,1,1,1,2021-01-01,8053.6,10,1,135.00,135.00,1.35,20210101
3,2,6,185,2021-01-01,150.4,8,1,150.40,150.40,1.50,20210101
4,3,7,31,2021-01-02,6087.0,5,2,2966.00,5932.00,0.00,20210102

In [16]:
def get_classe_produto(valor_produto):
    lista = []
    for valor in valor_produto:
        if valor <= 499.99:
            lista.append(1)
        elif valor <= 2999.99:
            lista.append(2)
        else:
            lista.append(3)
    return lista

ft_vendas_df['id_classe_produto'] = get_classe_produto(ft_vendas_df['valor_unitario'])

ft_vendas_df.head()

,idvenda,id_vendedor,id_cliente,data,total_venda,id_produto,quantidade,valor_unitario,valortotal,desconto_venda,id_tempo,id_classe_produto
0,1,1,1,2021-01-01,8053.6,2,1,7820.85,7820.85,0.00,20210101,3
1,1,1,1,2021-01-01,8053.6,9,1,97.75,97.75,0.98,20210101,1
2,1,1,1,2021-01-01,8053.6,10,1,135.00,135.00,1.35,20210101,1
3,2,6,185,2021-01-01,150.4,8,1,150.40,150.40,1.50,20210101,1
4,3,7,31,2021-01-02,6087.0,5,2,2966.00,5932.00,0.00,20210102,2

In [17]:
aux_df = pd.DataFrame()
aux_df['id_vendedor']= ft_vendas_df['id_vendedor']
aux_df['id_venda']= ft_vendas_df['idvenda']
aux_df['total_venda']= ft_vendas_df['total_venda']
aux_df.drop_duplicates(inplace=True)

aux_df = aux_df.groupby(['id_vendedor'])['total_venda'].agg('sum')
aux_df

id_vendedor
1     269511.04
2     425929.36
3     318265.78
4     327094.38
5     355440.67
6     263880.37
7     264414.92
8     183089.51
9     347815.24
10    298726.46
Name: total_venda, dtype: float64

In [18]:
def get_nivel_vendedor(id_vendedor):
    lista = []
    for item in id_vendedor:
        total_vendido = aux_df[item]
        if total_vendido <= 199999:
            lista.append(1)
        elif total_vendido <= 299999:
            lista.append(2)
        else:
            lista.append(3)
    return lista

ft_vendas_df['id_nivel_vendedor'] = get_nivel_vendedor(ft_vendas_df['id_vendedor'])

ft_vendas_df.head()

,idvenda,id_vendedor,id_cliente,data,total_venda,id_produto,quantidade,valor_unitario,valortotal,desconto_venda,id_tempo,id_classe_produto,id_nivel_vendedor
0,1,1,1,2021-01-01,8053.6,2,1,7820.85,7820.85,0.00,20210101,3,2
1,1,1,1,2021-01-01,8053.6,9,1,97.75,97.75,0.98,20210101,1,2
2,1,1,1,2021-01-01,8053.6,10,1,135.00,135.00,1.35,20210101,1,2
3,2,6,185,2021-01-01,150.4,8,1,150.40,150.40,1.50,20210101,1,2
4,3,7,31,2021-01-02,6087.0,5,2,2966.00,5932.00,0.00,20210102,2,2

In [19]:
ft_vendas_df.drop(
    columns=['idvenda', 'valortotal', 'quantidade', 'data'],
    inplace=True,
)
ft_vendas_df.head()

,id_vendedor,id_cliente,total_venda,id_produto,valor_unitario,desconto_venda,id_tempo,id_classe_produto,id_nivel_vendedor
0,1,1,8053.6,2,7820.85,0.00,20210101,3,2
1,1,1,8053.6,9,97.75,0.98,20210101,1,2
2,1,1,8053.6,10,135.00,1.35,20210101,1,2
3,6,185,150.4,8,150.40,1.50,20210101,1,2
4,7,31,6087.0,5,2966.00,0.00,20210102,2,2

# 3 - Load

In [20]:
# Criação da engine do sql alchemy para o banco dimensional.
db_connection_out = sqlalchemy.create_engine(
    'postgresql+pg8000://postgres:123456@localhost:5434/dimensional_db',
    client_encoding='utf8',
)

In [21]:
# Função para calculo do chunksize
def get_chunksize(table_columns):
    cs = 2097 // len(table_columns)
    cs = (1000 if cs > 1000 else cs)
    return cs

In [22]:
# Exportação do dataframe dm_cliente_df do pandas para a tabela dm_cliente
dm_cliente_df.to_sql(
    name='dm_cliente',
    schema='dimensional',
    con=db_connection_out,
    index=False,
    if_exists='append',
    chunksize=get_chunksize(dm_cliente_df.columns),
)

250